{
    "home": "Home",
    "cart": "My Cart",
    "signUp": "Sign Up",
    "login": "Log In",
    "search": "Search",
    "shopName": "Delighted Bicycle Shop",
    "legal": "Legalization, Distribution",
    "product": "Products",
    "merchandise": "Merchandise",
    "sort": "Sorting",
    "aboutUs": "About Us",
    "maintenance": "Maintenance",
    "privacyRefund": "Privacy, Refund",
    "outdoor": "Outdoor Sport",
    "electricMobility": "Electric Mobility",
    "manualBicycle": "Manual Bicycle",
    "accessories": "Accessories",
    "sortbylower": "Sort by lower price priority",
    "sortbyhigher": "Sort by higher price priority",
    "enter": "Enter keywords/product number",
    "companyName": "Huahua Technology Commuting Research Co., Ltd.",
    "location1": "Address: Jinmen Gaohua Industrial Building",
    "experienceStore": "Smart Vehicle Experience Store (Temporary Retail Point): 1/F, 101 Xinhai Road, Yulong Village, Jinmen Riverside Bike Path, Jinmen",
    "path": "Path",
    "officeHours1": "Monday to Friday 13:00~18:00 (appointments available until 19:00)",
    "officeHours2": "Saturdays, Sundays, and holidays 1200~1800 (appointments available until 1900)",
    "vocation": "Closed on Thursdays",
    "distribution": "Distribution Channels: Major appliance chain stores, mainstream sports equipment stores, large online stores, 3C digital stores, automotive/motorcycle shops, automotive supplies/service stores, computer stores, bicycle shops, etc.",
    "distributionRule": "(Distribution is prioritized based on store nature and location, with early joiners given preference.)",
    "target": "Development Goal: Plan to enter comprehensive distribution mode within two years",
    "priceRange": "Price Range",
    "maintenancePolicy": "Maintenance Policy",
    "maintenanceDes1": "Main Components Covered by Maintenance: Controllers and instruments, motors, chassis, handlebars (T-bars), stem, pedals, front fork, rear fork, shock absorbers, folding mechanism, battery, and charger.",
    "maintenanceDes2": "Exclusions from Maintenance Coverage: Inner tubes, front wheels, mudguards, pedal decorations, charging ports, sandpaper, headlights, handlebar grips, paintwork, etc.",
    "maintenanceDes3": "The following situations are considered non-warranty and require paid repairs (a $100 inspection fee will be charged if obvious water ingress or damage is observed):",
    "span1": "1. Damage caused by human error.",
    "span2": "2. Damage due to force majeure.",
    "span3": "3. Water ingress, immersion, or fire damage is not covered.",
    "span4": "4. Any damage resulting from improper use, maintenance, or adjustments not in accordance with the user manual.",
    "span5": "5. Malfunctions or damage caused by misuse, such as overloading, riding obstacles (including but not limited to riding up high steps or falling), extreme sports, etc.",
    "span6": "6. Unauthorized system repairs carried out without approval from our technical staff.",
    "span7": "7. Total mileage exceeding 1500 kilometers.",
    "batteryMaintenance": "Battery Maintenance",
    "battery1": "Avoid leaving the battery in high temperatures (above 50°C) or low temperatures (below -2°C).",
    "battery2": "For example, do not leave the electric scooter in direct sunlight inside a car during summer. Do not throw the battery into fire or water, as this may result in battery failure, overheating, or even fire hazards.",
    "battery3": "Avoid fully discharging the battery before recharging, and recharge promptly whenever possible. This significantly extends the battery's lifespan. Additionally, when using the electric scooter at room temperature, the battery will operate for longer periods.",
    "battery4": "However, at temperatures below 0°C, both battery lifespan and performance decrease. Typically, at -20°C, the battery's capacity is only half or less compared to room temperature.",
    "tips": "Tips",
    "tip1": "The battery inside the electric vehicle will discharge within 90-120 days. If not used frequently, recharge the electric vehicle every 30-50 days. Failure to timely charge the battery may result in irreversible damage, which is not covered by the warranty policy.",
    "tip2": "Note that damage caused by prolonged lack of charging is not eligible for warranty. (Please refrain from unauthorized battery disassembly, as it may lead to serious accidents or short circuits.)",
    "expire": "If, after the warranty period, spare parts are sufficiently stocked, we will provide repair quotations.",
    "company": "Company Name:",
    "destination": "Address:",
    "distributionChannel1": "Distribution Channels: Appliance chain stores, lifestyle department stores/supermarkets, sports/camping equipment stores, online platforms, 3C digital stores, automotive/motorcycle shops, automotive supplies/service stores, etc.",
    "distributionChannel2": "(To facilitate smooth distribution, allocation is based on store nature and location, with priority given to early joiners.)",
    "p-1": "We",
    "Lspan1": "initiated our operations as early as 2015",
    "p-2": "to provide convenient commuting solutions for the public.",
    "p-3": "This initiative not only offers more travel options for citizens but also ",
    "Lspan2": "creates business opportunities for our products.",
    "des": "We are authorized agents for popular brands such as ",
    "Lspan3": "We cordially invite you to become an authorized distributor and share in the market opportunities of smart commuting.",
    "Lspan4": "You can choose from various collaboration methods based on practical considerations,",
    "Lspan5": "such as maintaining store inventory and conducting promotional activities or consigning sample displays. After successfully operating for more than 3 months,",
    "Lspan6": "you can qualify as an authorized distributor.",
    "p-4": "We are a company focused on the development and sales of intelligent commuting products. We firmly believe that technology can enhance human life, and smart commuting is a crucial direction. We provide high-quality products and comprehensive after-sales services, including delivery and repair services all in one place.",
    "p-5": "If you are interested in becoming a distribution partner, we are pleased to provide further details about our products and business, allowing you to experience product quality.",
    "Lspan7": "Smart Vehicle Experience Store: ONEONE Smart Vehicle (temporary retail point in Jinmen,",
    "Lspan8": "with the goal of transitioning to comprehensive distribution within 1-2 years).",
    "location2": "Address: 1/F, 101 Xinhai Road, Yulong Village, Jinmen Riverside Bike Path",
    "coordination": "Feel free to contact us to explore collaboration opportunities!",
    "closing": "Huahua Technology, Yours Sincerely",
    "privacyPolicy": "Privacy Policy",
    "welcome": "Welcome to 'Zhonglele Bicycle Shop' (hereinafter referred to as 'this website'). To ensure your confidence in using our website services and information, we hereby explain our privacy protection policy to safeguard your rights. Please read the following content:",
    "scope": "1. Scope of Privacy Protection Policy",
    "scopeDes1": "The content of the privacy protection policy includes how this website handles personal identification data collected when you use our website services.",
    "scopeDes2": "The privacy protection policy does not apply to websites linked from this website or to personnel not commissioned or involved in managing this website.",
    "useGuideline": "2. Collection, Processing, and Use of Personal Data",
    "guide1": "When you visit this website or use the provided functional services, we will collect necessary personal data based on the nature of the service.",
    "guide2": "We process and use your personal data within the specific purpose scope. Without your written consent, this website will not use personal data for other purposes.",
    "guide3": "When you interact with features such as service mailboxes or surveys, we retain the information you provide, including name, email address, contact details, and usage time.",
    "guide4": "Server logs record relevant actions during general browsing, including IP addresses, browsing time, browser type, and click data.",
    "guide5": "These logs are for internal reference and will not be disclosed externally.",
    "guide6": "We analyze and statistically process survey content to present statistical data or explanatory text, but this does not involve specific individual information.",
    "guide7": "If you wish to inquire about, modify, or delete account-related data, please use the communication methods provided on the website,",
    "guide8": "including email, Messenger, WhatsApp, or direct phone calls. We will respond within five working days.",
    "privacyPolicyBetterFuture": "Empowering Commuting for a Better Future",
    "operation": "With 8 years of dedicated effort, we strive for continuous development to serve Hong Kong's short-distance commuting needs.",
    "protection": "3. Data Protection",
    "protectionP-1": "Our website servers are equipped with firewalls, antivirus systems, and other relevant information security devices and necessary security measures to",
    "protectionP-2": "protect the website and your personal data. Only authorized personnel can access your personal data,",
    "protectionP-3": "and all relevant staff have signed confidentiality agreements.",
    "protectionP-4": "If it is necessary to commission other units to provide services due to business needs, this website will strictly require compliance with confidentiality obligations and perform necessary inspection procedures to ensure compliance.",
    "externalLink": "4. Related External Links",
    "internetConnection1": "The web pages of this website provide internet links to other websites. You can also enter other websites through the links provided on this website.",
    "internetConnection2": "However, the privacy protection policy of this website does not apply to linked websites. Please refer to the privacy protection policy of the linked website.",
    "thirdPTY": "5. Policy on Sharing Personal Data with Third Parties",
    "notforsell1": "This website will never provide, exchange, rent, or sell any of your personal data to other individuals,",
    "notforsell2": "groups, private companies, or government agencies, except when there is legal basis or contractual obligations.",
    "exception": "Exceptions to the above include, but are not limited to:",
    "writtenConsent": "Written consent from you.",
    "legalRequirement": "Legal requirements.",
    "preventDanger": "To prevent danger to your life, body, freedom, or property.",
    "corporation1": "Cooperation with government agencies or academic research institutions for statistical or academic research purposes,",
    "corporation2": "where data cannot identify specific individuals based on disclosure methods.",
    "violation1": "When your behavior on the website violates the terms of service or may harm or hinder the rights of the website and other users,",
    "violation2": "and disclosing your personal data is necessary for identification, contact, or legal action.",
    "interest": "In your best interest.",
    "collection": "When this website commissions vendors to collect, process, or use your personal data, we will strictly supervise and manage their compliance with confidentiality obligations.",
    "cookies": "6. Use of Cookies",
    "useofcookies": "To provide you with the best service, this website places and accesses our cookies on your computer.",
    "notAccept": "If you do not wish to accept cookie writing, you can set your browser's privacy level to high, which will reject cookie writing. However, this may cause certain website functions to malfunction.",
    "privacyCorrection": "7. Privacy Policy Amendments",
    "demandCorrection": "This website's privacy protection policy will be subject to revisions based on demand, and the updated terms will be published on the website.",
    "refund": "About Refund:",
    "refundCon": "All products are not refundable, if you have any inquiries, please contact us.",
    "aboutUsDesh51": "Quality",
    "aboutUsDesspan1": "First, ",
    "aboutUsDesh52": "Service",
    "aboutUsDesspan2": "First",
    "aboutUsDesp1": "We firmly believe that technology should enhance human convenience, and innovations in personal mobility contribute to an improved quality of life. Since 2015, we have been promoting and operating with a team of passionate tech enthusiasts. In 2020, we officially registered as Huahua Technology Commuting Research Co., Ltd. (KEEN), and our brand, oneoneboy scooter® (formerly KEEN.hk), was born to facilitate short-distance commuting for the public.",
    "servicePhilosophy": "Service Philosophy:",
    "servieP": "Our mission is to prioritize customer satisfaction and safety. We are committed to advancing personal mobility solutions, addressing the needs of short-distance travelers. Our goal is to provide practical, cost-effective personal mobility devices that meet international safety standards, thereby contributing to the overall development of this industry.",
    "commutionBetter": "Empowering Commuting for a Better Future",
    "joyfulP": "With 8 years of dedicated effort, we continue to pursue sustainable growth, serving our customers' short-distance commuting needs.",
    "thirdspan1": "*Manufacturer of the happy scooter brand",
    "thirdspan2": "*Exclusive distributor for DYU Smart Bikes across Asia",
    "thirdspan3": "*Exclusive distributor for NAICISPORTS Lithium Electric Bicycles across Asia",
    "thirdspan4": "*Exclusive distributor for Dafei Electric Scooters across Asia",
    "footer": "Eight years of dedicated effort, continuous pursuit of growth, and a commitment to serving customers’ short-distance commuting needs.",
    "newUser": "New User Registration",
    "register": "Register",
    "email": "Email",
    "PW": "Password",
    "confirmPW": "Confirm Password",
    "customContact": "Contact Number",
    "qty": "Quantity",
    "price": "Price",
    "action": "Action",
    "checkOut": "Check Out",
    "sum": "Total Amount",
    "productIntro": "Product Description",
    "or": "or",
    "become": "Become a member of Delighted Bikes Shop, electric skateboard?",
    "here": "You can here",
    "removeChoice": "Remove Selected",
    "cost": "Price",
    "choice": "Choice",
    "white": "White",
    "black": "Black",
    "order": "Place Order",
    "add": "Add to Cart",
    "contactShop": "Contact Shop Owner",
    "make-comment": "Make a Comment",
    "comment": "There are no reviews for this product yet, be the first to create a review for it",
    "back": "Return to login page",
    "autoLogin": "Automatic login",
    "logtoShop": "Customer Log In",
    "logtoAdminBoard": "Login Administrator Dashboard",
    "forgetPW": "Forgot your password?",
    "admin": "Administrator Log In",
    "userlogin": "User Login",
    "shopRecord": "Shopping History",
    "customerName": "Name",
    "registerationDay": "Member since",
    "check": "Check Records",
    "personalInfo": "Personal Information",
    "details": "MY DETAILS",
    "edit": "EDIT DETAILS",
    "loginDetail": "LOGIN DETAILS",
    "updatePW": "UPDATE PASSWORD",
    "gender": "Gender",
    "Phone": "Phone Number",
    "logoutAll": "Log out from all devices",
    "text": "To access the Store website again, you need to provide your credentials. This action will log you out from any other web browsers you have used before.",
    "text2": "Hey there ! Feel free to edit any of your details below so your account is up to date.",
    "logout": "Logout Account",
    "welcomeBack": "Welcome back! Happy shopping!",
    "overview": "Profile Overview",
    "hi": "Hi",
    "user": "User",
    "orders": "Order",
    "changePW": "Reset Password",
    "newPW": "Confirm New Password",
    "cancel": "Cancel",
    "updatePD": "Update Profile Deatils",
    "updateProfile": "Update Profile",
    "upload": "Upload Avatar",
    "payMethod": "Payment Method",
    "cardNumbers": "Card Numbers",
    "checkout": "Checkout",
    "adminlogin": "Administrator Login"
}